In [7]:
import pandas as pd

In [8]:
ser = pd.Series([100, 'foo', 300, 'bar', 500], ['tom', 'bob', 'nancy', 'dan', 'eric'])
ser

tom      100
bob      foo
nancy    300
dan      bar
eric     500
dtype: object

In [9]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [12]:
serOne = pd.Series(data = [100, 'foo', 300, 'bar', 500, 'what'], index = ['apple', 'ball', 'cat', 'dog', 'elephant', 'cat'])
serOne

apple        100
ball         foo
cat          300
dog          bar
elephant     500
cat         what
dtype: object

In [14]:
serOne['cat']

cat     300
cat    what
dtype: object

In [15]:
serOne.loc['cat']

cat     300
cat    what
dtype: object

In [16]:
serOne.iloc[1]

'foo'

In [17]:
serOne[['apple', 'cat']]

apple     100
cat       300
cat      what
dtype: object

In [18]:
serOne[[1, 2, 3]]

ball    foo
cat     300
dog     bar
dtype: object

In [24]:
'cat' in serOne

True

In [28]:
'foo' in serOne.values

True

In [29]:
serOne

apple        100
ball         foo
cat          300
dog          bar
elephant     500
cat         what
dtype: object

In [30]:
serOne* 2

apple            200
ball          foofoo
cat              600
dog           barbar
elephant        1000
cat         whatwhat
dtype: object

In [36]:
serOne[['apple','elephant']] ** 2

apple        10000
elephant    250000
dtype: object

In [39]:
panDict = {'one' : pd.Series(data = [1, 2, 3, 4], index = ['Apple', 'Ball', 'Cat', 'Dog']),
          'two' : pd.Series(data = [1, 2, 3, 5], index = ['Apple', 'Ball', 'Cat', 'Elephant'])}

In [41]:
df = pd.DataFrame(panDict)
df

          one  two
Apple     1.0  1.0
Ball      2.0  2.0
Cat       3.0  3.0
Dog       4.0  NaN
Elephant  NaN  5.0

In [42]:
df.columns

Index(['one', 'two'], dtype='object')

In [43]:
df.index

Index(['Apple', 'Ball', 'Cat', 'Dog', 'Elephant'], dtype='object')

In [45]:
pd.DataFrame(panDict, index = ['Apple', 'Ball', 'Cat'])

       one  two
Apple    1    1
Ball     2    2
Cat      3    3

In [46]:
data = [{1 : 'Apple', 2 : 'Ball'}, {3 : 'Cat', 4 : 'Dog'}]

In [48]:
pd.DataFrame(data, index=['One', 'Two'])

         1     2    3    4
One  Apple  Ball  NaN  NaN
Two    NaN   NaN  Cat  Dog

In [49]:
pd.DataFrame(data)

       1     2    3    4
0  Apple  Ball  NaN  NaN
1    NaN   NaN  Cat  Dog

In [55]:
pd.DataFrame(data, columns = [1, 4])

       1    4
0  Apple  NaN
1    NaN  Dog

In [56]:
df

          one  two
Apple     1.0  1.0
Ball      2.0  2.0
Cat       3.0  3.0
Dog       4.0  NaN
Elephant  NaN  5.0

In [60]:
df['one']

Apple       1.0
Ball        2.0
Cat         3.0
Dog         4.0
Elephant    NaN
Name: one, dtype: float64

In [64]:
df.loc['Apple']

one    1.0
two    1.0
Name: Apple, dtype: float64

In [66]:
df['three'] = df['one'] * df['two']
df

          one  two  three
Apple     1.0  1.0    1.0
Ball      2.0  2.0    4.0
Cat       3.0  3.0    9.0
Dog       4.0  NaN    NaN
Elephant  NaN  5.0    NaN

In [67]:
df['one']['Apple']

1.0

In [73]:
df['one']['Frog'] = df['one']['Apple'] + df['one']['Ball']
df['one']['Frog']

3.0

In [75]:
df.shape

(5, 3)

In [76]:
df['Flag'] = df['one'] > 2
df

          one  two  three   Flag
Apple     1.0  1.0    1.0  False
Ball      2.0  2.0    4.0  False
Cat       3.0  3.0    9.0   True
Dog       4.0  NaN    NaN   True
Elephant  NaN  5.0    NaN  False

In [77]:
three = df.pop('three')
three

Apple       1.0
Ball        4.0
Cat         9.0
Dog         NaN
Elephant    NaN
Name: three, dtype: float64

In [78]:
df

          one  two   Flag
Apple     1.0  1.0  False
Ball      2.0  2.0  False
Cat       3.0  3.0   True
Dog       4.0  NaN   True
Elephant  NaN  5.0  False

In [79]:
df['Temp'] = df['Flag'] == True
df

          one  two   Flag   Temp
Apple     1.0  1.0  False  False
Ball      2.0  2.0  False  False
Cat       3.0  3.0   True   True
Dog       4.0  NaN   True   True
Elephant  NaN  5.0  False  False

In [80]:
Flag = df.pop('Flag')

In [81]:
df

          one  two   Temp
Apple     1.0  1.0  False
Ball      2.0  2.0  False
Cat       3.0  3.0   True
Dog       4.0  NaN   True
Elephant  NaN  5.0  False

In [82]:
df.pop('Temp')

Apple       False
Ball        False
Cat          True
Dog          True
Elephant    False
Name: Temp, dtype: bool

In [83]:
df['three'] = three
df['Flag'] = Flag

In [84]:
df

          one  two  three   Flag
Apple     1.0  1.0    1.0  False
Ball      2.0  2.0    4.0  False
Cat       3.0  3.0    9.0   True
Dog       4.0  NaN    NaN   True
Elephant  NaN  5.0    NaN  False

In [85]:
del df['three']
df

          one  two   Flag
Apple     1.0  1.0  False
Ball      2.0  2.0  False
Cat       3.0  3.0   True
Dog       4.0  NaN   True
Elephant  NaN  5.0  False

In [88]:
df['two']['Dog'] = 10.0
df

C:\Users\Xenon\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

          one   two   Flag
Apple     1.0   1.0  False
Ball      2.0   2.0  False
Cat       3.0   3.0   True
Dog       4.0  10.0   True
Elephant  NaN   5.0  False

In [89]:
df.insert(0, 'copy_of_one', df['one'])
df

          copy_of_one  one   two   Flag
Apple             1.0  1.0   1.0  False
Ball              2.0  2.0   2.0  False
Cat               3.0  3.0   3.0   True
Dog               4.0  4.0  10.0   True
Elephant          NaN  NaN   5.0  False

In [102]:
df.pop('half_copy_two')

Apple       1.0
Ball        2.0
Cat         NaN
Dog         NaN
Elephant    NaN
Name: half_copy_two, dtype: float64

In [103]:
df['half_copy_two'] = df['two'][:2]
df

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [104]:
listOne = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [109]:
listOne[2:5 and 7:]

[3, 4, 5, 6, 7]